#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-cC5B2fMnd1ij5TPE

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_api_gateway_method.proxy has been changed
  ~ resource "aws_api_gateway_method" "proxy" {
      + authorization_scopes = []
        id                   = "agm-gcp9dahm4c-oly2td-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }
  # aws_iam_role.iam_for_lambda has been changed
  ~ resource "aws_iam_role" "iam_for_lambda" {
        id                    = "iam_for_lambda"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ]
        name                  = "iam_for_lambda"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_api_gateway_rest_api.sso_backend has been changed
  ~ resource "aws_api_gateway_rest_api" "sso_backend" {
        id                           = "gcp9dahm4c"
        name                         = "SSOApi"
      + tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_api_gateway_method.proxy_root has been changed
  ~ resource "aws_api_gateway_method" "proxy_root" {
      + authorization_scopes = []
        id                   = "agm-gcp9dahm4c-irntllxe14-ANY"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "gcp9dahm4c"
      + stage_name    = "test"
    }

  # aws_api_gateway_integration.lambda will be created
  + resource "aws_api_gateway_integration" "lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "oly2td"
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.lambda_root will be created
  + resource "aws_api_gateway_integration" "lambda_root" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "irntllxe14"
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_lambda_function.auth will be created
  + resource "aws_lambda_function" "auth" {
      + arn                            = (known after apply)
      + filename                       = "app.zip"
      + function_name                  = "handler"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "1lniCNuvSfohFoKvq9AAZem2aBl+nmFXDXTZwJYtWM4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "handler"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/*/*"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for AWS lambda and AWS RDS connection"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "127.0.0.1/32",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "rds_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-018906cab60cf165b"
    }

  # aws_subnet.rds_lambda_subnets["first"] will be created
  + resource "aws_subnet" "rds_lambda_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = "vpc-018906cab60cf165b"
    }

  # aws_subnet.rds_lambda_subnets["second"] will be created
  + resource "aws_subnet" "rds_lambda_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = "vpc-018906cab60cf165b"
    }

  # aws_subnet.rds_lambda_subnets["third"] will be created
  + resource "aws_subnet" "rds_lambda_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = "vpc-018906cab60cf165b"
    }

  # module.db.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster aurora-db-postgres"
      + id          = (known after apply)
      + name        = "aurora-db-postgres"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"      = "aurora-aurora-db-postgres"
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Name"      = "aurora-aurora-db-postgres"
          + "Terraform" = "true"
        }
    }

  # module.db.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 7
      + cluster_identifier                  = "aurora-db-postgres"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = "ExampleDB"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "aurora-db-postgres"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "serverless"
      + engine_version                      = (known after apply)
      + final_snapshot_identifier           = "final-aurora-db-postgres-00ccecea"
      + global_cluster_identifier           = ""
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = (sensitive)
      + port                                = 5432
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + replication_source_identifier       = ""
      + skip_final_snapshot                 = true
      + source_region                       = ""
      + storage_encrypted                   = true
      + tags                                = {
          + "Terraform" = "true"
        }
      + tags_all                            = {
          + "Terraform" = "true"
        }
      + vpc_security_group_ids              = (known after apply)

      + scaling_configuration {
          + auto_pause               = true
          + max_capacity             = 2
          + min_capacity             = 0
          + seconds_until_auto_pause = 300
          + timeout_action           = "ForceApplyCapacityChange"
        }
    }

  # module.db.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aurora-db-postgres-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "aurora-aurora-db-postgres"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Name"      = "aurora-aurora-db-postgres"
          + "Terraform" = "true"
        }
      + vpc_id                 = "vpc-018906cab60cf165b"
    }

  # module.db.aws_security_group_rule.default_ingress[0] will be created
  + resource "aws_security_group_rule" "default_ingress" {
      + description              = "From allowed SGs"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + base_url = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $86.4/mo +$86.4
```

</details>

*Pusher: @jlangy, Action: `pull_request`*